[Killed] StringLiteral
src/app.ts:12:9
 // Stryker disable next-line StringLiteral: Hono treats "" and '*' as equivalent in app.use() — both register the middleware for all routes
 app.use('*', cors());
 
-app.get('/api/health', createHealthHandler());
+app.get("", createHealthHandler());
 app.route('/api/users', createUsersRouter(usersService));
 
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/app.ts:13:11
 app.use('*', cors());
 
 app.get('/api/health', createHealthHandler());
-app.route('/api/users', createUsersRouter(usersService));
+app.route("", createUsersRouter(usersService));
 
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404
