[Killed] BlockStatement
src/modules/users/users.routes.ts:6:45
 import { createUserSchema, updateUserSchema } from "./users.schemas";
 import type { UsersService } from "./users.service";
 
-function mapError(err: unknown, c: Context) {
-  if (err instanceof NotFoundError) return c.json({ error: err.message }, 404);
-  if (err instanceof DuplicateEmailError)
-    return c.json({ error: err.message }, 409);
-  return c.json({ error: "Internal server error" }, 500);
-}
+function mapError(err: unknown, c: Context) {}
 
 export function createUsersRouter(service: UsersService): Hono {
killedBy: POST /users — create user returns 409 when service throws DuplicateEmailError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 404

[Killed] ObjectLiteral
src/modules/users/users.routes.ts:9:19
 function mapError(err: unknown, c: Context) {
   if (err instanceof NotFoundError) return c.json({ error: err.message }, 404);
   if (err instanceof DuplicateEmailError)
-    return c.json({ error: err.message }, 409);
+    return c.json({}, 409);
   return c.json({ error: "Internal server error" }, 500);
 }
killedBy: POST /users — create user 409 response body contains an error message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Killed] StringLiteral
src/modules/users/users.routes.ts:10:26
   if (err instanceof NotFoundError) return c.json({ error: err.message }, 404);
   if (err instanceof DuplicateEmailError)
     return c.json({ error: err.message }, 409);
-  return c.json({ error: "Internal server error" }, 500);
+  return c.json({ error: "" }, 500);
 }
 
killedBy: POST /users — create user 500 response body has error field with "Internal server error"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Internal server error"
Received: ""

[Killed] BlockStatement
src/modules/users/users.routes.ts:16:32
 export function createUsersRouter(service: UsersService): Hono {
   const router = new Hono();
   // Stryker disable next-line StringLiteral -- '' and '/' are the same for Hono
-  router.get("/", async (c) => {
-    const users = await service.findAll();
-    return c.json(users);
-  });
+  router.get("/", async (c) => {});
   // Stryker disable next-line StringLiteral -- '' and '/' are the same for Hono
   router.post("/", async (c) => {
killedBy: GET /users — list all users returns 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/modules/users/users.routes.ts:21:33
     return c.json(users);
   });
   // Stryker disable next-line StringLiteral -- '' and '/' are the same for Hono
-  router.post("/", async (c) => {
-    const body = await c.req.json().catch(() => ({}));
-    const result = createUserSchema.safeParse(body);
-    if (!result.success) {
-      return c.json(
-        // Stryker disable next-line LogicalOperator,OptionalChaining,StringLiteral -- Zod always provides at least one issue; fallback is unreachable
-        { error: result.error.issues[0]?.message ?? "Validation error" },
-        400,
-      );
-    }
-    try {
-      const user = await service.create(result.data);
-      return c.json(user, 201);
-    } catch (err) {
-      return mapError(err, c);
-    }
-  });
+  router.post("/", async (c) => {});
 
   router.get("/:id", async (c) => {
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ArrowFunction
src/modules/users/users.routes.ts:22:43
   });
   // Stryker disable next-line StringLiteral -- '' and '/' are the same for Hono
   router.post("/", async (c) => {
-    const body = await c.req.json().catch(() => ({}));
+    const body = await c.req.json().catch(() => undefined);
     const result = createUserSchema.safeParse(body);
     if (!result.success) {
killedBy: POST /users — create user returns 400 (not 500) when request body is not valid JSON
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "expected object"
Received string:        "Invalid input: expected object, received undefined"

[Killed] BlockStatement
src/modules/users/users.routes.ts:31:9
         400,
       );
     }
-    try {
-      const user = await service.create(result.data);
-      return c.json(user, 201);
-    } catch (err) {
+    try {} catch (err) {
       return mapError(err, c);
     }
killedBy: POST /users — create user returns 201 on valid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] BlockStatement
src/modules/users/users.routes.ts:34:19
     try {
       const user = await service.create(result.data);
       return c.json(user, 201);
-    } catch (err) {
-      return mapError(err, c);
-    }
+    } catch (err) {}
   });
 
killedBy: POST /users — create user returns 409 when service throws DuplicateEmailError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 404

[Killed] BlockStatement
src/modules/users/users.routes.ts:39:35
     }
   });
 
-  router.get("/:id", async (c) => {
-    const id = c.req.param("id");
-    try {
-      const user = await service.findById(id);
-      return c.json(user);
-    } catch (err) {
-      return mapError(err, c);
-    }
-  });
+  router.get("/:id", async (c) => {});
 
   router.put("/:id", async (c) => {
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/modules/users/users.routes.ts:41:9
 
   router.get("/:id", async (c) => {
     const id = c.req.param("id");
-    try {
-      const user = await service.findById(id);
-      return c.json(user);
-    } catch (err) {
+    try {} catch (err) {
       return mapError(err, c);
     }
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/modules/users/users.routes.ts:44:19
     try {
       const user = await service.findById(id);
       return c.json(user);
-    } catch (err) {
-      return mapError(err, c);
-    }
+    } catch (err) {}
   });
 
killedBy: Integration: delete user DELETE removes the user — subsequent GET returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BlockStatement
src/modules/users/users.routes.ts:49:35
     }
   });
 
-  router.put("/:id", async (c) => {
-    const id = c.req.param("id");
-    const body = await c.req.json().catch(() => ({}));
-    const result = updateUserSchema.safeParse(body);
-    if (!result.success) {
-      return c.json(
-        // Stryker disable next-line LogicalOperator,OptionalChaining,StringLiteral -- Zod always provides at least one issue; fallback is unreachable
-        { error: result.error.issues[0]?.message ?? "Validation error" },
-        400,
-      );
-    }
-    try {
-      const user = await service.update(id, result.data);
-      return c.json(user);
-    } catch (err) {
-      return mapError(err, c);
-    }
-  });
+  router.put("/:id", async (c) => {});
 
   router.delete("/:id", async (c) => {
killedBy: Integration: update user PUT updates user name and GET reflects the change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArrowFunction
src/modules/users/users.routes.ts:51:43
 
   router.put("/:id", async (c) => {
     const id = c.req.param("id");
-    const body = await c.req.json().catch(() => ({}));
+    const body = await c.req.json().catch(() => undefined);
     const result = updateUserSchema.safeParse(body);
     if (!result.success) {
killedBy: PUT /users/:id — update user non-JSON body is treated as an empty update (no-op)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/modules/users/users.routes.ts:60:9
         400,
       );
     }
-    try {
-      const user = await service.update(id, result.data);
-      return c.json(user);
-    } catch (err) {
+    try {} catch (err) {
       return mapError(err, c);
     }
killedBy: PUT /users/:id — update user returns 200 with updated user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/modules/users/users.routes.ts:68:38
     }
   });
 
-  router.delete("/:id", async (c) => {
-    const id = c.req.param("id");
-    try {
-      await service.delete(id);
-      return c.body(null, 204);
-    } catch (err) {
-      return mapError(err, c);
-    }
-  });
+  router.delete("/:id", async (c) => {});
 
   return router;
killedBy: DELETE /users/:id — delete user returns 204 on successful deletion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 404

[Killed] BlockStatement
src/modules/users/users.routes.ts:70:9
 
   router.delete("/:id", async (c) => {
     const id = c.req.param("id");
-    try {
-      await service.delete(id);
-      return c.body(null, 204);
-    } catch (err) {
+    try {} catch (err) {
       return mapError(err, c);
     }
killedBy: Integration: delete user DELETE removes the user — subsequent GET returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 500

[Killed] BlockStatement
src/modules/users/users.routes.ts:73:19
     try {
       await service.delete(id);
       return c.body(null, 204);
-    } catch (err) {
-      return mapError(err, c);
-    }
+    } catch (err) {}
   });
 
killedBy: Integration: delete user DELETE on non-existent user returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500
