[Killed] BooleanLiteral
src/health.ts:12:20
 };
 
 const defaults: HealthDeps = {
-  isHealthy: () => true,
+  isHealthy: () => false,
   getUptime: () => process.uptime(),
   getVersion: () => pkg.version,
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 409

[Killed] ArrowFunction
src/health.ts:14:15
 const defaults: HealthDeps = {
   isHealthy: () => true,
   getUptime: () => process.uptime(),
-  getVersion: () => pkg.version,
+  getVersion: () => undefined,
 };
 
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
src/health.ts:25:32
     const healthy = isHealthy();
 
     const body = {
-      status: healthy ? 'ok' : 'degraded',
+      status: healthy ? 'ok' : "",
       uptime: {
         seconds: uptimeSeconds,
killedBy: GET /api/health — degraded server status is "degraded"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "degraded"
Received: ""

[Killed] ObjectLiteral
src/health.ts:26:15
 
     const body = {
       status: healthy ? 'ok' : 'degraded',
-      uptime: {
-        seconds: uptimeSeconds,
-        human: formatUptime(uptimeSeconds),
-      },
+      uptime: {},
       version: getVersion() ?? 'unknown',
       environment: process.env.NODE_ENV ?? 'development',
killedBy: GET /api/health — healthy server uptime.seconds is a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] LogicalOperator
src/health.ts:30:16
         seconds: uptimeSeconds,
         human: formatUptime(uptimeSeconds),
       },
-      version: getVersion() ?? 'unknown',
+      version: getVersion() && 'unknown',
       environment: process.env.NODE_ENV ?? 'development',
       nodeVersion: process.version,
killedBy: GET /api/health — healthy server version matches package.json
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0.0"
Received: "unknown"

[Killed] LogicalOperator
src/health.ts:31:20
         human: formatUptime(uptimeSeconds),
       },
       version: getVersion() ?? 'unknown',
-      environment: process.env.NODE_ENV ?? 'development',
+      environment: process.env.NODE_ENV && 'development',
       nodeVersion: process.version,
     };
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404
