[Killed] StringLiteral
src/lib/errors.ts:10:11
 
 export class DuplicateEmailError extends Error {
   constructor(email: string) {
-    super(`Email already exists: ${email}`);
+    super(``);
     this.name = 'DuplicateEmailError';
   }
killedBy: DuplicateEmailError message includes the email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Email already exists: alice@example.com"
Received: ""
