[Killed] ConditionalExpression
src/modules/users/users.repository.ts:14:34
 }
 
 function isPrismaP2002(err: unknown): boolean {
-  return err instanceof Error && (err as { code?: string }).code === 'P2002';
+  return err instanceof Error && true;
 }
 
killedBy: Integration: create user second POST with same email returns 409
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 201

[Killed] EqualityOperator
src/modules/users/users.repository.ts:14:34
 }
 
 function isPrismaP2002(err: unknown): boolean {
-  return err instanceof Error && (err as { code?: string }).code === 'P2002';
+  return err instanceof Error && (err as {
+  code?: string;
+}).code !== 'P2002';
 }
 
killedBy: prismaUsersRepository.create maps Prisma P2002 error to DuplicateEmailError
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: DuplicateEmailError
Received constructor: Error

Received message: "Unique constraint violated"

      53 |

[Killed] ConditionalExpression
src/modules/users/users.repository.ts:22:11
     try {
       return await prisma.user.create({ data: input });
     } catch (err) {
-      if (isPrismaP2002(err)) throw new DuplicateEmailError(input.email);
+      if (true) throw new DuplicateEmailError(input.email);
       throw err;
     }
killedBy: prismaUsersRepository.create propagates non-P2002 Prisma errors unchanged
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Connection refused"
Received message:   "Email already exists: alice@example.com"

      90 |         } else {
      91 |           stryCov_9fa48("42");
    > 92 |           if (stryMutAct_9fa48("44") ? false : stryMutAct_9fa48("43") ? true : (stryCov_9fa48("43", "44"), isPrismaP2002(err))) throw new DuplicateEmailError(input.

[Killed] ConditionalExpression
src/modules/users/users.repository.ts:22:11
     try {
       return await prisma.user.create({ data: input });
     } catch (err) {
-      if (isPrismaP2002(err)) throw new DuplicateEmailError(input.email);
+      if (false) throw new DuplicateEmailError(input.email);
       throw err;
     }
killedBy: prismaUsersRepository.create maps Prisma P2002 error to DuplicateEmailError
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: DuplicateEmailError
Received constructor: Error

Received message: "Unique constraint violated"

      53 |

[Killed] BlockStatement
src/modules/users/users.repository.ts:44:20
     }
   },
 
-  async delete(id) {
-    await prisma.user.delete({ where: { id } });
-  },
+  async delete(id) {},
 };
 
killedBy: prismaUsersRepository.delete calls prisma.user.delete with the provided id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"id": "1"}}

Number of calls: 0
