[Killed] MethodExpression
src/modules/users/users.schemas.ts:3:19
 import { z } from 'zod';
 
-const nameField = z.string().min(1);
+const nameField = z.string().max(1);
 const emailField = z.string().email().toLowerCase();
 
killedBy: POST /users — create user returns 201 on valid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] MethodExpression
src/modules/users/users.schemas.ts:4:20
 import { z } from 'zod';
 
 const nameField = z.string().min(1);
-const emailField = z.string().email().toLowerCase();
+const emailField = z.string().email().toUpperCase();
 
 export const createUserSchema = z.object({
killedBy: POST /users — create user passes validated input to service.create
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "email": "alice@example.com",
+   "email": "ALICE@EXAMPLE.COM",
