[Killed] ArithmeticOperator
src/utils/uptime.ts:4:24
 export function formatUptime(seconds: number): string {
   const total = Math.floor(seconds);
 
-  const d = Math.floor(total / 86400);
+  const d = Math.floor(total * 86400);
   const h = Math.floor((total % 86400) / 3600);
   const m = Math.floor((total % 3600) / 60);
killedBy: Integration: create user POST with invalid email returns 400 and does not create a user
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 2
Received array:  [{"createdAt": "2026-06-19T08:56:10.180Z", "email": "alice@example.com", "id": "cmqkp29c40007r25rhbmqr53c", "name": "Alice"}, {"createdAt": "2026-06-19T08:56:10.181Z", "email": "bob@example.com", "id": "cmqkp29c50008r25rjtskwc97", "name": "Bob"}]

[Killed] ArithmeticOperator
src/utils/uptime.ts:5:24
   const total = Math.floor(seconds);
 
   const d = Math.floor(total / 86400);
-  const h = Math.floor((total % 86400) / 3600);
+  const h = Math.floor(total % 86400 * 3600);
   const m = Math.floor((total % 3600) / 60);
   const s = total % 60;
killedBy: Integration: delete user DELETE removes the user — GET /api/users no longer lists it
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"createdAt": "2026-06-19T08:56:10.196Z", "email": "alice@example.com", "id": "cmqkp29ck0004rs5rioh90bhw", "name": "Alice"}]

[Killed] ArithmeticOperator
src/utils/uptime.ts:5:25
   const total = Math.floor(seconds);
 
   const d = Math.floor(total / 86400);
-  const h = Math.floor((total % 86400) / 3600);
+  const h = Math.floor((total * 86400) / 3600);
   const m = Math.floor((total % 3600) / 60);
   const s = total % 60;
killedBy: formatUptime — seconds only (< 60) returns "1s" for 1 second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1s"
Received: "24h 1s"

[Killed] ArithmeticOperator
src/utils/uptime.ts:6:25
 
   const d = Math.floor(total / 86400);
   const h = Math.floor((total % 86400) / 3600);
-  const m = Math.floor((total % 3600) / 60);
+  const m = Math.floor((total * 3600) / 60);
   const s = total % 60;
 
killedBy: formatUptime — seconds only (< 60) returns "1s" for 1 second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1s"
Received: "60m 1s"

[Killed] ArithmeticOperator
src/utils/uptime.ts:6:24
 
   const d = Math.floor(total / 86400);
   const h = Math.floor((total % 86400) / 3600);
-  const m = Math.floor((total % 3600) / 60);
+  const m = Math.floor(total % 3600 * 60);
   const s = total % 60;
 
killedBy: Integration: create user POST then GET returns the same user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 409

[Killed] ArithmeticOperator
src/utils/uptime.ts:7:13
   const d = Math.floor(total / 86400);
   const h = Math.floor((total % 86400) / 3600);
   const m = Math.floor((total % 3600) / 60);
-  const s = total % 60;
+  const s = total * 60;
 
   const parts: string[] = [];
killedBy: formatUptime — seconds only (< 60) returns "1s" for 1 second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1s"
Received: "60s"

[Killed] ConditionalExpression
src/utils/uptime.ts:10:7
   const s = total % 60;
 
   const parts: string[] = [];
-  if (d > 0) parts.push(`${d}d`);
+  if (false) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
killedBy: Integration: delete user DELETE removes the user — GET /api/users no longer lists it
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"createdAt": "2026-06-19T08:56:11.099Z", "email": "alice@example.com", "id": "cmqkp2a1n0004r15rmgcuavel", "name": "Alice"}]

[Killed] EqualityOperator
src/utils/uptime.ts:10:7
   const s = total % 60;
 
   const parts: string[] = [];
-  if (d > 0) parts.push(`${d}d`);
+  if (d <= 0) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
killedBy: Integration: update user PUT updates user name and GET reflects the change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/utils/uptime.ts:11:7
 
   const parts: string[] = [];
   if (d > 0) parts.push(`${d}d`);
-  if (h > 0) parts.push(`${h}h`);
+  if (false) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
killedBy: Integration: update user PUT with duplicate email returns 409
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 500

[Killed] ConditionalExpression
src/utils/uptime.ts:11:7
 
   const parts: string[] = [];
   if (d > 0) parts.push(`${d}d`);
-  if (h > 0) parts.push(`${h}h`);
+  if (true) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
killedBy: formatUptime — zero returns "0s" for 0 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0s"
Received: "0h"

[Killed] ConditionalExpression
src/utils/uptime.ts:12:7
   const parts: string[] = [];
   if (d > 0) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
-  if (m > 0) parts.push(`${m}m`);
+  if (false) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
 
killedBy: formatUptime — minutes boundary returns "1m" for exactly 60 seconds — omits zero seconds unit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1m"
Received: "0s"

[Killed] EqualityOperator
src/utils/uptime.ts:12:7
   const parts: string[] = [];
   if (d > 0) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
-  if (m > 0) parts.push(`${m}m`);
+  if (m <= 0) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
 
killedBy: GET /api/health — zero uptime uptime.human is "0s"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0s"
Received: "0m"

[Killed] EqualityOperator
src/utils/uptime.ts:13:7
   if (d > 0) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
-  if (s > 0) parts.push(`${s}s`);
+  if (s <= 0) parts.push(`${s}s`);
 
   return parts.length > 0 ? parts.join(' ') : '0s';
killedBy: formatUptime — seconds only (< 60) returns "1s" for 1 second
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1s"
Received: "0s"

[Killed] ConditionalExpression
src/utils/uptime.ts:13:7
   if (d > 0) parts.push(`${d}d`);
   if (h > 0) parts.push(`${h}h`);
   if (m > 0) parts.push(`${m}m`);
-  if (s > 0) parts.push(`${s}s`);
+  if (false) parts.push(`${s}s`);
 
   return parts.length > 0 ? parts.join(' ') : '0s';
killedBy: Integration: delete user DELETE removes the user — subsequent GET returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 500

[Killed] ConditionalExpression
src/utils/uptime.ts:15:10
   if (m > 0) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
 
-  return parts.length > 0 ? parts.join(' ') : '0s';
+  return true ? parts.join(' ') : '0s';
 }
 
killedBy: formatUptime — zero returns "0s" for 0 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0s"
Received: ""

[Killed] ConditionalExpression
src/utils/uptime.ts:15:10
   if (m > 0) parts.push(`${m}m`);
   if (s > 0) parts.push(`${s}s`);
 
-  return parts.length > 0 ? parts.join(' ') : '0s';
+  return false ? parts.join(' ') : '0s';
 }
 
killedBy: Integration: create user second POST with same email returns 409
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 201
