[Killed] ConditionalExpression
src/modules/users/users.service.ts:23:11
 
     async update(id: string, input: UpdateUserInput): Promise<User> {
       const user = await repo.findById(id);
-      if (!user) throw new NotFoundError(`User ${id} not found`);
+      if (true) throw new NotFoundError(`User ${id} not found`);
       return repo.update(id, input);
     },
killedBy: Integration: update user PUT updates user name and GET reflects the change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/modules/users/users.service.ts:23:11
 
     async update(id: string, input: UpdateUserInput): Promise<User> {
       const user = await repo.findById(id);
-      if (!user) throw new NotFoundError(`User ${id} not found`);
+      if (false) throw new NotFoundError(`User ${id} not found`);
       return repo.update(id, input);
     },
killedBy: Integration: update user PUT on non-existent user returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BlockStatement
src/modules/users/users.service.ts:27:45
       return repo.update(id, input);
     },
 
-    async delete(id: string): Promise<void> {
-      const user = await repo.findById(id);
-      if (!user) throw new NotFoundError(`User ${id} not found`);
-      return repo.delete(id);
-    },
+    async delete(id: string): Promise<void> {},
   };
 }
killedBy: Integration: delete user DELETE removes the user — GET /api/users no longer lists it
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"createdAt": "2026-06-19T08:56:17.884Z", "email": "alice@example.com", "id": "cmqkp2fa40001r15rluet2kjy", "name": "Alice"}]
